packages/panel-vendure/src/plugins/chasqui-plugin/payment-mercadopago/mocks/payments_search_another_currency.json

{
  "paging": {
    "total": 1,
    "limit": 30,
    "offset": 0
  },
  "results": [
    {
      "metadata": {},
      "corporation_id": null,
      "operation_type": "regular_payment",
      "point_of_interaction": {},
      "fee_details": [
        {
          "amount": 4.1,
          "fee_payer": "collector",
          "type": "mercadopago_fee"
        }
      ],
      "notification_url": null,
      "date_approved": "2021-10-07T12:58:32.639-04:00",
      "money_release_schema": null,
      "payer": {
        "first_name": null,
        "last_name": null,
        "email": "test_user_80507629@testuser.com",
        "identification": {
          "number": "32659430",
          "type": "DNI"
        },
        "phone": {
          "area_code": null,
          "number": null,
          "extension": null
        },
        "type": null,
        "entity_type": null,
        "id": "127729747"
      },
      "transaction_details": {
        "total_paid_amount": 100,
        "acquirer_reference": null,
        "installment_amount": 100,
        "financial_institution": null,
        "net_received_amount": 95.9,
        "overpaid_amount": 0,
        "external_resource_url": null,
        "payable_deferral_period": null,
        "payment_method_reference_id": null
      },
      "statement_descriptor": "TETE6632272",
      "call_for_authorize_id": null,
      "installments": 1,
      "pos_id": null,
      "external_reference": "D357LW8WM554FRTW",
      "date_of_expiration": null,
      "charges_details": [],
      "id": 1242139585,
      "payment_type_id": "credit_card",
      "order": {
        "id": "3378456997",
        "type": "mercadopago"
      },
      "counter_currency": null,
      "brand_id": null,
      "status_detail": "accredited",
      "differential_pricing_id": null,
      "additional_info": {
        "authentication_code": null,
        "ip_address": "181.230.146.221",
        "nsu_processadora": null,
        "available_balance": null,
        "items": [
          {
            "quantity": "2",
            "category_id": null,
            "picture_url": null,
            "description": null,
            "id": null,
            "title": "Semillas de Coriandro.",
            "unit_price": "50.0"
          }
        ]
      },
      "live_mode": false,
      "marketplace_owner": null,
      "card": {
        "first_six_digits": "450995",
        "expiration_year": 2025,
        "date_created": "2021-10-07T12:58:32.000-04:00",
        "expiration_month": 11,
        "id": null,
        "cardholder": {
          "identification": {
            "number": "11111111",
            "type": "DNI"
          },
          "name": "APRO"
        },
        "last_four_digits": "3704",
        "date_last_updated": "2021-10-07T12:58:32.000-04:00"
      },
      "integrator_id": null,
      "status": "approved",
      "transaction_amount_refunded": 0,
      "transaction_amount": 470,
      "description": "Semillas de Coriandro.",
      "money_release_date": "2021-10-25T12:58:32.639-04:00",
      "merchant_number": null,
      "refunds": [],
      "authorization_code": null,
      "captured": true,
      "collector_id": 835446788,
      "merchant_account_id": null,
      "taxes_amount": 0,
      "date_last_updated": "2021-10-07T12:58:32.639-04:00",
      "coupon_amount": 0,
      "store_id": null,
      "date_created": "2021-10-07T12:58:32.549-04:00",
      "acquirer_reconciliation": [],
      "sponsor_id": null,
      "shipping_amount": 0,
      "issuer_id": "310",
      "payment_method_id": "visa",
      "binary_mode": false,
      "platform_id": null,
      "deduction_schema": null,
      "processing_mode": "aggregator",
      "currency_id": "UYU",
      "shipping_cost": 0
    }
  ]
}